GopalSaraf/Practicals/PSDL/include/proc/pic16lf18326.h
extern volatile SLRCONAbits_t SLRCONAbits __at(0x30C);
// bitfield macros
#define _SLRCONA_SLRA0_POSN                                 0x0
#define _SLRCONA_SLRA0_POSITION                             0x0
#define _SLRCONA_SLRA0_SIZE                                 0x1
#define _SLRCONA_SLRA0_LENGTH                               0x1
#define _SLRCONA_SLRA0_MASK                                 0x1
#define _SLRCONA_SLRA1_POSN                                 0x1
#define _SLRCONA_SLRA1_POSITION                             0x1
#define _SLRCONA_SLRA1_SIZE                                 0x1
#define _SLRCONA_SLRA1_LENGTH                               0x1
#define _SLRCONA_SLRA1_MASK                                 0x2
#define _SLRCONA_SLRA2_POSN                                 0x2
#define _SLRCONA_SLRA2_POSITION                             0x2
#define _SLRCONA_SLRA2_SIZE                                 0x1
#define _SLRCONA_SLRA2_LENGTH                               0x1
#define _SLRCONA_SLRA2_MASK                                 0x4
#define _SLRCONA_SLRA4_POSN                                 0x4
#define _SLRCONA_SLRA4_POSITION                             0x4
#define _SLRCONA_SLRA4_SIZE                                 0x1
#define _SLRCONA_SLRA4_LENGTH                               0x1
#define _SLRCONA_SLRA4_MASK                                 0x10
#define _SLRCONA_SLRA5_POSN                                 0x5
#define _SLRCONA_SLRA5_POSITION                             0x5
#define _SLRCONA_SLRA5_SIZE                                 0x1
#define _SLRCONA_SLRA5_LENGTH                               0x1
#define _SLRCONA_SLRA5_MASK                                 0x20

// Register: SLRCONC
#define SLRCONC SLRCONC
extern volatile unsigned char           SLRCONC             __at(0x30E);
#ifndef _LIB_BUILD
asm("SLRCONC equ 030Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRC0                  :1;
        unsigned SLRC1                  :1;
        unsigned SLRC2                  :1;
        unsigned SLRC3                  :1;
        unsigned SLRC4                  :1;
        unsigned SLRC5                  :1;
    };
} SLRCONCbits_t;
extern volatile SLRCONCbits_t SLRCONCbits __at(0x30E);
// bitfield macros
#define _SLRCONC_SLRC0_POSN                                 0x0
#define _SLRCONC_SLRC0_POSITION                             0x0
#define _SLRCONC_SLRC0_SIZE                                 0x1
#define _SLRCONC_SLRC0_LENGTH                               0x1
#define _SLRCONC_SLRC0_MASK                                 0x1
#define _SLRCONC_SLRC1_POSN                                 0x1
#define _SLRCONC_SLRC1_POSITION                             0x1
#define _SLRCONC_SLRC1_SIZE                                 0x1
#define _SLRCONC_SLRC1_LENGTH                               0x1
#define _SLRCONC_SLRC1_MASK                                 0x2
#define _SLRCONC_SLRC2_POSN                                 0x2
#define _SLRCONC_SLRC2_POSITION                             0x2
#define _SLRCONC_SLRC2_SIZE                                 0x1
#define _SLRCONC_SLRC2_LENGTH                               0x1
#define _SLRCONC_SLRC2_MASK                                 0x4
#define _SLRCONC_SLRC3_POSN                                 0x3
#define _SLRCONC_SLRC3_POSITION                             0x3
#define _SLRCONC_SLRC3_SIZE                                 0x1
#define _SLRCONC_SLRC3_LENGTH                               0x1
#define _SLRCONC_SLRC3_MASK                                 0x8
#define _SLRCONC_SLRC4_POSN                                 0x4
#define _SLRCONC_SLRC4_POSITION                             0x4
#define _SLRCONC_SLRC4_SIZE                                 0x1
#define _SLRCONC_SLRC4_LENGTH                               0x1
#define _SLRCONC_SLRC4_MASK                                 0x10
#define _SLRCONC_SLRC5_POSN                                 0x5
#define _SLRCONC_SLRC5_POSITION                             0x5
#define _SLRCONC_SLRC5_SIZE                                 0x1
#define _SLRCONC_SLRC5_LENGTH                               0x1
#define _SLRCONC_SLRC5_MASK                                 0x20

// Register: CCPR3
#define CCPR3 CCPR3
extern volatile unsigned short          CCPR3               __at(0x311);
#ifndef _LIB_BUILD
asm("CCPR3 equ 0311h");
#endif

// Register: CCPR3L
#define CCPR3L CCPR3L
extern volatile unsigned char           CCPR3L              __at(0x311);
#ifndef _LIB_BUILD
asm("CCPR3L equ 0311h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR3L                 :8;
    };
} CCPR3Lbits_t;
extern volatile CCPR3Lbits_t CCPR3Lbits __at(0x311);
// bitfield macros
#define _CCPR3L_CCPR3L_POSN                                 0x0
#define _CCPR3L_CCPR3L_POSITION                             0x0
#define _CCPR3L_CCPR3L_SIZE                                 0x8
#define _CCPR3L_CCPR3L_LENGTH                               0x8
#define _CCPR3L_CCPR3L_MASK                                 0xFF

// Register: CCPR3H
#define CCPR3H CCPR3H
extern volatile unsigned char           CCPR3H              __at(0x312);
#ifndef _LIB_BUILD
asm("CCPR3H equ 0312h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR3H                 :8;
    };
} CCPR3Hbits_t;
extern volatile CCPR3Hbits_t CCPR3Hbits __at(0x312);
// bitfield macros
#define _CCPR3H_CCPR3H_POSN                                 0x0
#define _CCPR3H_CCPR3H_POSITION                             0x0
#define _CCPR3H_CCPR3H_SIZE                                 0x8
#define _CCPR3H_CCPR3H_LENGTH                               0x8
#define _CCPR3H_CCPR3H_MASK                                 0xFF

// Register: CCP3CON
#define CCP3CON CCP3CON
extern volatile unsigned char           CCP3CON             __at(0x313);
#ifndef _LIB_BUILD
asm("CCP3CON equ 0313h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3MODE               :4;
        unsigned CCP3FMT                :1;
        unsigned CCP3OUT                :1;
        unsigned                        :1;
        unsigned CCP3EN                 :1;
    };
    struct {
        unsigned CCP3MODE0              :1;
        unsigned CCP3MODE1              :1;
        unsigned CCP3MODE2              :1;
        unsigned CCP3MODE3              :1;
    };
} CCP3CONbits_t;
extern volatile CCP3CONbits_t CCP3CONbits __at(0x313);
// bitfield macros
#define _CCP3CON_CCP3MODE_POSN                              0x0
#define _CCP3CON_CCP3MODE_POSITION                          0x0
#define _CCP3CON_CCP3MODE_SIZE                              0x4
#define _CCP3CON_CCP3MODE_LENGTH                            0x4
#define _CCP3CON_CCP3MODE_MASK                              0xF
#define _CCP3CON_CCP3FMT_POSN                               0x4
#define _CCP3CON_CCP3FMT_POSITION                           0x4
#define _CCP3CON_CCP3FMT_SIZE                               0x1
#define _CCP3CON_CCP3FMT_LENGTH                             0x1
#define _CCP3CON_CCP3FMT_MASK                               0x10
#define _CCP3CON_CCP3OUT_POSN                               0x5
#define _CCP3CON_CCP3OUT_POSITION                           0x5
#define _CCP3CON_CCP3OUT_SIZE                               0x1
#define _CCP3CON_CCP3OUT_LENGTH                             0x1
#define _CCP3CON_CCP3OUT_MASK                               0x20
#define _CCP3CON_CCP3EN_POSN                                0x7
#define _CCP3CON_CCP3EN_POSITION                            0x7
#define _CCP3CON_CCP3EN_SIZE                                0x1
#define _CCP3CON_CCP3EN_LENGTH                              0x1
#define _CCP3CON_CCP3EN_MASK                                0x80
#define _CCP3CON_CCP3MODE0_POSN                             0x0
#define _CCP3CON_CCP3MODE0_POSITION                         0x0
#define _CCP3CON_CCP3MODE0_SIZE                             0x1
#define _CCP3CON_CCP3MODE0_LENGTH                           0x1
#define _CCP3CON_CCP3MODE0_MASK                             0x1
#define _CCP3CON_CCP3MODE1_POSN                             0x1
#define _CCP3CON_CCP3MODE1_POSITION                         0x1
#define _CCP3CON_CCP3MODE1_SIZE                             0x1
#define _CCP3CON_CCP3MODE1_LENGTH                           0x1
#define _CCP3CON_CCP3MODE1_MASK                             0x2
#define _CCP3CON_CCP3MODE2_POSN                             0x2
#define _CCP3CON_CCP3MODE2_POSITION                         0x2
#define _CCP3CON_CCP3MODE2_SIZE                             0x1
#define _CCP3CON_CCP3MODE2_LENGTH                           0x1
#define _CCP3CON_CCP3MODE2_MASK                             0x4
#define _CCP3CON_CCP3MODE3_POSN                             0x3
#define _CCP3CON_CCP3MODE3_POSITION                         0x3
#define _CCP3CON_CCP3MODE3_SIZE                             0x1
#define _CCP3CON_CCP3MODE3_LENGTH                           0x1
#define _CCP3CON_CCP3MODE3_MASK                             0x8

// Register: CCP3CAP
#define CCP3CAP CCP3CAP
extern volatile unsigned char           CCP3CAP             __at(0x314);
#ifndef _LIB_BUILD
asm("CCP3CAP equ 0314h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3CTS                :4;
    };
    struct {
        unsigned CCP3CTS0               :1;
        unsigned CCP3CTS1               :1;
        unsigned CCP3CTS2               :1;
        unsigned CCP3CTS3               :1;
    };
} CCP3CAPbits_t;
extern volatile CCP3CAPbits_t CCP3CAPbits __at(0x314);
// bitfield macros
#define _CCP3CAP_CCP3CTS_POSN                               0x0
#define _CCP3CAP_CCP3CTS_POSITION                           0x0
#define _CCP3CAP_CCP3CTS_SIZE                               0x4
#define _CCP3CAP_CCP3CTS_LENGTH                             0x4
#define _CCP3CAP_CCP3CTS_MASK                               0xF
#define _CCP3CAP_CCP3CTS0_POSN                              0x0
#define _CCP3CAP_CCP3CTS0_POSITION                          0x0
#define _CCP3CAP_CCP3CTS0_SIZE                              0x1
#define _CCP3CAP_CCP3CTS0_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS0_MASK                              0x1
#define _CCP3CAP_CCP3CTS1_POSN                              0x1
#define _CCP3CAP_CCP3CTS1_POSITION                          0x1
#define _CCP3CAP_CCP3CTS1_SIZE                              0x1
#define _CCP3CAP_CCP3CTS1_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS1_MASK                              0x2
#define _CCP3CAP_CCP3CTS2_POSN                              0x2
#define _CCP3CAP_CCP3CTS2_POSITION                          0x2
#define _CCP3CAP_CCP3CTS2_SIZE                              0x1
#define _CCP3CAP_CCP3CTS2_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS2_MASK                              0x4
#define _CCP3CAP_CCP3CTS3_POSN                              0x3
#define _CCP3CAP_CCP3CTS3_POSITION                          0x3
#define _CCP3CAP_CCP3CTS3_SIZE                              0x1
#define _CCP3CAP_CCP3CTS3_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS3_MASK                              0x8

// Register: CCPR4
#define CCPR4 CCPR4
extern volatile unsigned short          CCPR4               __at(0x315);
#ifndef _LIB_BUILD
asm("CCPR4 equ 0315h");
#endif

// Register: CCPR4L
#define CCPR4L CCPR4L
extern volatile unsigned char           CCPR4L              __at(0x315);
#ifndef _LIB_BUILD
asm("CCPR4L equ 0315h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR4L                 :8;
    };
} CCPR4Lbits_t;
